In [23]:
import pandas as pd

In [24]:
df = pd.read_csv("./csv's/aug_train.csv")
df.head()

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
0,8949,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,NaN,NaN,1,36,1.0
1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0.0
2,11561,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,5,NaN,NaN,never,83,0.0
3,33241,city_115,0.789,NaN,No relevent experience,NaN,Graduate,Business Degree,<1,NaN,Pvt Ltd,never,52,1.0
4,666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,0.0

Opening CSV from URL

In [25]:
#importing csv from a url
url = "https://raw.githubusercontent.com/adhi1911/DS-learnings/main/Pandas/nyc_weather.csv?token=GHSAT0AAAAAACGWXROQU4ISKAMEY3GDGAYQZPZLZJA"

In [26]:
import requests
from io import StringIO

# headers = {"User-Agent": "Mozilla/5.0"}
req = requests.get(url )
data = StringIO(req.text)
df1 = pd.read_csv(data)
df1.head()

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
0,1/1/2016,38,23,52,30.03,10,8.0,0,5,NaN,281
1,1/2/2016,36,18,46,30.02,10,7.0,0,3,NaN,275
2,1/3/2016,40,21,47,29.86,10,8.0,0,1,NaN,277
3,1/4/2016,25,9,44,30.05,10,9.0,0,3,NaN,345
4,1/5/2016,20,-3,41,30.57,10,5.0,0,0,NaN,333

If dealong with tab seperated files...

read_csv has sep=',' by default. We can explicitely change this as per use

for tab : '\t'

### names

give column names while reading csv itself.

names=['list of column names']

In [27]:
df2 = pd.read_csv("./csv's/aug_train.csv" , usecols = ['enrollee_id' ,'city','gender'])
df2.head()

   enrollee_id      city gender
0         8949  city_103   Male
1        29725   city_40   Male
2        11561   city_21    NaN
3        33241  city_115    NaN
4          666  city_162   Male

### Squeeze

lets suppose we pass only one column name in usecols and state squeeze = True
then df3 will be a series object or int64 not a dataframe

In [28]:
# df3 = pd.read_csv("./csv's/aug_train.csv" , usecols = ['enrollee_id'] , squeeze = True)

Skiprows / nrows

## dtype

In [34]:
df.dtypes

enrollee_id                 int64
city                       object
city_development_index    float64
gender                     object
relevent_experience        object
enrolled_university        object
education_level            object
major_discipline           object
experience                 object
company_size               object
company_type               object
last_new_job               object
training_hours              int64
target                    float64
dtype: object

We can see target column is of type float64 . Let's change it to int64

In [39]:
df['target'] = df['target'].astype(int)
df.dtypes

enrollee_id                 int64
city                       object
city_development_index    float64
gender                     object
relevent_experience        object
enrolled_university        object
education_level            object
major_discipline           object
experience                 object
company_size               object
company_type               object
last_new_job               object
training_hours              int64
target                      int32
dtype: object